x=1:100
y=sin(x)
plot(x,y)
# типизация.1 тип данных(нумерикал численные данные) 2тип-текстовый|символ 
#логика -значение вида тру\фолс
z=c("А", "Б", "В")
x=1:10
y=c(T,F,TRUE,FALSE)
#-Базовая переменная-вектор(матрица единичной размерности). Матрица-множество чисел 
t=1
x+t
z+x
x+w
w="A"
u=c("A",23,T)
#автоматически превращает в один тип данных
s=c(1,T,F,0)
#char-numeric-logic
f=c(x,y,u,s)
#оператор С - оператор объединения 
a<-2
b<-3
a->b #присвоение значение согласно направлению
assign("t", "text")
#paste(работа со строками)-суть слепление строковых значение которые мы даем
y=(log10(sin(x^(-3))))
x=1:10000